Documents/ПоказанияСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоказанияСчетчиков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТекущиеПоказания</xr:Item>
				<xr:Item>AccumulationRegister.ПотреблениеЭлектроэнергии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Показания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущееПоказание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПотреблениеКвт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ТекущиеПоказания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеПоказания</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетчикиБоксов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СчетчикиБоксов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетчикиВводов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СчетчикиВводов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСчетчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийПриборУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПриборУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Счетчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Счетчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентТрансформации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежповерочныйИнтервал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПоказанияСчетчиков/Forms/ФормаПланшет/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Показания.Количество() > 0 Тогда
		ТекущийИндекс = 0;
		ПоказатьСтроку();
	Иначе
		Прогресс = "Нажмите ""Заполнить""";	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказания(Команда)
	Если Объект.Показания.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьЗавершение", ЭтотОбъект); 
		ПоказатьВопрос(Оповещение, "Заполнить заново? Введённые показания будут стёрты.",РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет, , )
	Иначе
		ЗаполнитьТаблицуНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТаблицуНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	Объект.Показания.Очистить();
	Момент = Объект.Дата - 1;	
	Запрос = Новый Запрос;
	    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Счетчики.Ссылка КАК Счетчик,
    |	ЕСТЬNULL(ТекущиеПоказанияСрезПоследних.Показание, 0) КАК Показание,
    |	ЕСТЬNULL(СчетчикиБоксовСрезПоследних.Бокс.Код, ЕСТЬNULL(СчетчикиВводовСрезПоследних.Ввод.Код, """")) КАК КодМеста,
    |	Счетчики.ТипСчетчика КАК ТипСчетчика
    |ИЗ
    |	Справочник.Счетчики КАК Счетчики
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеПоказания.СрезПоследних(&Момент) КАК ТекущиеПоказанияСрезПоследних
    |		ПО ТекущиеПоказанияСрезПоследних.Счетчик = Счетчики.Ссылка
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетчикиБоксов.СрезПоследних(&Момент) КАК СчетчикиБоксовСрезПоследних
    |		ПО СчетчикиБоксовСрезПоследних.Счетчик = Счетчики.Ссылка
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетчикиВводов.СрезПоследних(&Момент) КАК СчетчикиВводовСрезПоследних
    |		ПО СчетчикиВводовСрезПоследних.Счетчик = Счетчики.Ссылка
    |ГДЕ
    |	НЕ Счетчики.ПометкаУдаления
    |	И (СчетчикиБоксовСрезПоследних.Счетчик ЕСТЬ НЕ NULL
    |		ИЛИ СчетчикиВводовСрезПоследних.Счетчик ЕСТЬ НЕ NULL)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ТипСчетчика УБЫВ,
    |	КодМеста,
    |	Счетчики.Код";
	
	Запрос.УстановитьПараметр("Момент", Момент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Стр = Объект.Показания.Добавить();
		Стр.Счетчик = Выборка.Счетчик;
		Стр.ПредыдущееПоказание = Выборка.Показание;
		Стр.Показание = Выборка.Показание;
	КонецЦикла;
	Если Объект.Показания.Количество() = 0 Тогда
        Прогресс = "Нет установленных счётчиков на дату документа.";
        Возврат;
    КонецЕсли;
	ТекущийИндекс = 0;
	ПоказатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура Следующий(Команда)
	ПерейтиНаСервере(1);
КонецПроцедуры

&НаКлиенте
Процедура Предыдущий(Команда)
	ПерейтиНаСервере(-1);
КонецПроцедуры 

&НаСервере
Процедура ПерейтиНаСервере(Смещение)
	Кол = Объект.Показания.Количество();
	Если Кол = 0 Тогда
		Возврат;
	КонецЕсли;  
	СохранитьВвод();
	ТекущийИндекс = Мин(Макс(ТекущийИндекс + Смещение, 0), Кол - 1);
	ПоказатьСтроку();
КонецПроцедуры

&НаСервере
Процедура СохранитьВвод() 
	Если ТекущееПоказание = Неопределено Тогда
        Возврат;
    КонецЕсли;
	Кол = Объект.Показания.Количество();
	Если ТекущийИндекс >= 0 И ТекущийИндекс < Кол Тогда
		Стр = Объект.Показания[ТекущийИндекс];
		Стр.Показание = ТекущееПоказание;
		Расчет = ЭлектроУчет.ДельтаПоказаний(Стр.Счетчик, Стр.ПредыдущееПоказание, ТекущееПоказание);
		Стр.ПотреблениеКвт = ?(Расчет.Успех, Расчет.Дельта, 0);
		Если Не Расчет.Успех Тогда
			Сообщить("Счётчик " + Строка(Стр.Счетчик) + ": " + Расчет.Сообщение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьСтроку()
	Стр = Объект.Показания[ТекущийИндекс];
	ТекущийСчетчик = Стр.Счетчик;
	ТекущееПредыдущее = Стр.ПредыдущееПоказание;
	ТекущееПоказание = Стр.Показание;
	ТекущееПотребление = Стр.ПотреблениеКвт;
	ЭтоОбщийСчетчик = Стр.Счетчик.ТипСчетчика = Перечисления.ТипыСчетчиков.ОбщийПриборУчета;
	Прогресс = ?(ЭтоОбщийСчетчик, "ВВОДНЫЙ СЧЁТЧИК (" + (ТекущийИндекс + 1) + " из " + Объект.Показания.Количество() + ")",
	"Счётчик " + (ТекущийИндекс + 1) + " из " + Объект.Показания.Количество());
КонецПроцедуры


&НаКлиенте
Процедура ТекущееПоказаниеПриИзменении(Элемент)
	Если ТекущееПоказание = Неопределено Тогда
        Возврат;
	КонецЕсли;
	ТекущееПотребление = Макс(ТекущееПоказание - ТекущееПредыдущее, 0);
	Если ТекущееПоказание < ТекущееПредыдущее Тогда
		Оповещение = Новый ОписаниеОповещения("ПредупреждениеЗавершение", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, "Показание меньше предыдущего - проверьте цифры.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеЗавершение(ДополнительныеПараметры) Экспорт
	// Продолжение после закрытия предупреждения - действий не требуется.
	ТекущийЭлемент = Элементы.ТекущееПоказание; // вернуть ввод на поле показания
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.Свойство("СпросилиПустыеПоказания") Тогда
		Возврат; // уже ответили "Да"  
	КонецЕсли;
	Если Не ПараметрыЗаписи.Свойство("Проведение") Тогда
		Возврат;
	КонецЕсли;
	БезПоказаний = 0;
	Примеры = "";
	Для каждого Стр Из Объект.Показания Цикл
		Если Стр.Счетчик.Пустая() Тогда
			Продолжить;
		КонецЕсли; 
		Если Стр.Показание = Стр.ПредыдущееПоказание Тогда
			БезПоказаний = БезПоказаний + 1;
			Если БезПоказаний <= 3 Тогда
				Примеры = Примеры + ?(Примеры = "", "", ",") + Строка(Стр.Счетчик);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	Если БезПоказаний = 0 Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	ПараметрыЗаписи.Вставить("СпросилиПустыеПоказания", Истина);
	Текст = "По " + БезПоказаний + " счётчикам не введены новые показания (потребление" + " по ним будет нулевым)."
	+ ?(Примеры = "", "", Символы.ПС + "Например: " + Примеры + ? (БезПоказаний > 3, " и др.", "") + ".")
	+ Символы.ПС + "Провести документ?";
	Оповещение = Новый ОписаниеОповещения("ПровестиПослеВопросаЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет, 0, , КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаСервере
Процедура СохранитьТекущийВводПередЗаписью() //дублируем СохранитьВВод, но без вывода сообщений  
	Если ТекущееПоказание = Неопределено Тогда
        Возврат;
	КонецЕсли;
	Кол = Объект.Показания.Количество();
	Если ТекущийИндекс >= 0 И ТекущийИндекс < Кол Тогда
		Стр = Объект.Показания[ТекущийИндекс];
		Стр.Показание = ТекущееПоказание;
		Расчет = ЭлектроУчет.ДельтаПоказаний(Стр.Счетчик, Стр.ПредыдущееПоказание, ТекущееПоказание);
		Стр.ПотреблениеКвт = ?(Расчет.Успех, Расчет.Дельта, 0);
	КонецЕсли;
КонецПроцедуры 


&НаКлиенте
Процедура ПровестиПослеВопросаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СохранитьТекущийВводПередЗаписью();
		Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;  
КонецПроцедуры
